Revit 2027 API
DistributionSysType.HighLegPhase Property
 The high-leg phase in the 3 phase 4 wires delta distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalPhaseLine HighLegPhase { get; set; }
Public Property HighLegPhase As ElectricalPhaseLine
	Get
	Set
public:
property ElectricalPhaseLine HighLegPhase {
	ElectricalPhaseLine get ();
	void set (ElectricalPhaseLine value);
}
member HighLegPhase : ElectricalPhaseLine with get, set
Property Value
ElectricalPhaseLine
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The high-leg phase eHighLegPhase is not valid, only A, B, C is valid.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The distribution system is not a 3 phase 4 wires delta distribution system.
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace